In [1]:
import pandas as pd

In [3]:
out = pd.read_html("data.html")

In [4]:
type(out)

list

In [5]:
out[0]

  Unnamed: 0  Phy  Chem  Math  Eng  Bio
0       Anuj   18    11    10   11   18
1      Mohan   17    10    13   13   11
2       Ravi   15    11    15   18   18
3     Bharat   12    19    16   16   12
4       Hari   12    12    13   17   10

In [9]:
out = pd.read_html("https://www.w3schools.com/html/html_tables.asp")

In [8]:
out[0]

                              0                 1        2
0                       Company           Contact  Country
1           Alfreds Futterkiste      Maria Anders  Germany
2    Centro comercial Moctezuma   Francisco Chang   Mexico
3                  Ernst Handel     Roland Mendel  Austria
4                Island Trading     Helen Bennett       UK
5  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
6  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [10]:
out

[                              0                 1        2
 0                       Company           Contact  Country
 1           Alfreds Futterkiste      Maria Anders  Germany
 2    Centro comercial Moctezuma   Francisco Chang   Mexico
 3                  Ernst Handel     Roland Mendel  Austria
 4                Island Trading     Helen Bennett       UK
 5  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 6  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
              0                                                  1
 0          Tag                                        Description
 1      <table>                                    Defines a table
 2         <th>                   Defines a header cell in a table
 3         <tr>                           Defines a row in a table
 4         <td>                          Defines a cell in a table
 5    <caption>                            Defines a table caption
 6   <colgroup>  Specifies a group of one or more columns in a ...
 7        <col>  Specifies column properties for each column wi...
 8      <thead>               Groups the header content in a table
 9      <tbody>                 Groups the body content in a table
 10     <tfoot>               Groups the footer content in a table]